[{
	"name": "Pumpkin Pie",
	"cooking": "35 - 40 mins",
	"ingredients": ["Ready made sweet short crust pastry with 40g/1.5oz crushed pecans mixed in or make your own",
		"450g/1lb prepared weight pumpkin flesh, cut unto 1in/2.5cm chunks",
		"2 large eggs plus 1 yolk",
		"75g/3oz soft dark brown sugar",
		"1 tsp ground cinnamon",
		"½ tsp freshly grated nutmeg",
		"½ tsp ground allspice",
		"½ tsp ground cloves",
		"½ tsp ground ginger",
		"275ml/10fl oz double cream"
	],
	"methods": [
		"Pre-heat the oven to 200C/400F/Gas 6",
		"If using a shop bought sweet crust pastry case, use one that is 23cm/9in diameter and 4cm/1.5in deep. If using your own pastry, roll it out and use it to line a 23cm/9in pie plate (not loose bottomed). Bake the pastry case blind for 20 minutes.",
		"To make the filling, place the pumpkin chunks on a baking tray, cover with foil and roast until tender. This will take about 20-30 minutes, depending on your pumpkin. Press the cooked pumpkin in a coarse sieve and to extract any excess water. Set aside to cool before blending in a food processor, or mashing by hand to a puree.",
		"Lightly whisk the eggs and extra yolk together in a large bowl.",
		"Place the sugar, spices and the cream in a pan, bring to simmering point, giving it a whisk to mix everything together. Then pour it over the eggs and whisk it again briefly. Now add the pumpkin puree, still whisking to combine everything thoroughly.",
		"Reduce the oven temperature to 180C/350F/Gas 4. Pour the filling into your pastry case and bake for 35-40 minutes, by which time it will puff up round the edges but still feel slightly wobbly in the centre.",
		"Remove the pie from the oven and place the tin on a wire cooling rack. Serve warm or chilled (stored loosely covered in foil in the fridge) with some chilled creme fraiche or whipped cream."
	]
}, {
	"name": "Marshmallow Cobweb Cake",
	"cooking": "30 mins",
	"ingredients": ["250g/9oz unsalted butter, softened, plus extra for greasing",
		"250g/9oz caster sugar",
		"4 free-range eggs, lightly beaten",
		"1 tsp vanilla extract",
		"½ tsp black gel food colour (optional)",
		"50g/2oz cocoa powder",
		"200g/7oz self-raising flour",
		"200g/7oz dark chocolate (at least 70% cocoa solids), chopped into small pieces",
		"200ml/7fl oz double cream",
		"10 white marshmallows",
		"edible candy eyes"
	],
	"methods": [
		"Preheat the oven to 180C/350F/Gas 4.",
		"To make the cake, grease and line a 20x30cm/8x12in rectangular cake tin with baking paper.",
		"Beat together the butter and sugar with a hand-held mixer until pale and fluffy. Add the eggs, a little at a time, beating well between each addition. Add the vanilla extract and the black gel food colouring, if using, with the last of the egg.",
		"Sift together the cocoa powder and flour into a bowl. Fold the flour into the butter mixture until fully combined. Spoon the batter into the prepared tin and smooth the surface with the back of a spoon",
		"Bake for 30 minutes, or until springy to the touch (a skewer inserted into the centre of the cake should come out clean). Leave to cool for 10 minutes in the tin before turning out onto a wire rack to cool completely",
		"To make the chocolate ganache icing, put the cream into a saucepan and bring just to the boil. Pour into a heatproof bowl. Add the chopped chocolate, a little at a time, and stir until completely melted and the ganache is smooth and glossy. Leave to cool for a few minutes until it feels just warm to the touch",
		"Place the cake (on the cooling rack) onto a large sheet of newspaper or baking paper. Pour half the ganache onto the centre of the cake and spread out evenly to coat the top and sides, adding more as needed, to make a nice even coat. Allow to cool and set",
		"Meanwhile, lightly butter a non-stick saucepan, add the marshmallows and melt over a low heat, stirring frequently (or place in a lightly buttered heatproof bowl and microwave in 10 second bursts until melted, stiring often). The marshmallows don't need to melt completely before you remove them from the heat - they will continue melting on their own - but don't burn or overheat the marshmallow",
		"Check the marshmallow isn't too hot before taking a pinch between your fingers and pulling it appart so it makes thin strands. Drape the strands all over the cake in an irregular zig zag fashion. When the marshmallow in your fingers cools too much to pull, rinse your fingers in warm water and start again with another pinch. Place the edible eyes in pairs in the gaps between the marshmallow cobweb."
	]
}, {
	"name": "Rocky Road Crunch Bars",
	"cooking": "less than 10 mins",
	"ingredients": ["125g/4½oz soft unsalted butter",
		"300g/10½oz best-quality dark chocolate, broken into pieces",
		"3 tbsp golden syrup",
		"200g/7¼oz rich tea biscuits",
		"100g/3½oz mini marshmallows",
		"2 tsp icing sugar, to dust"
	],
	"methods": [
		"Heat the butter, chocolate and golden syrup in a heavy-based saucepan over a gentle heat. Remove from the heat, scoop out about 125ml/4½fl oz of the melted mixture and set aside in a bowl.",
		"Place the biscuits into a plastic freezer bag and crush them with a rolling pin until some have turned to crumbs but there are still pieces of biscuit remaining.",
		"Fold the biscuit pieces and crumbs into the melted chocolate mixture in the saucepan, then add the marshmallows.",
		"Tip the mixture into a 24cm/9in square baking tin and smooth the top with a wet spatula.",
		"Pour over the reserved 125ml/4½fl oz of the melted chocolate mixture and smooth the top with a wet spatula.",
		"Refrigerate for about two hours or overnight.",
		"To serve, cut into 24 fingers and dust with icing sugar."
	]
}, {
	"name": "Peanut Butter Squares",
	"cooking": "30 mins",
	"ingredients": ["150g/5½oz butter",
		"200g/7oz dark chocolate (at least 60% cocoa solids) or milk chocolate (or a mixture of both)",
		"250g/9oz digestive biscuits",
		"200g/7oz soft light brown sugar",
		"300g/10½oz crunchy peanut butter",
		"1 tsp vanilla extract"
	],
	"methods": [
		"Line a 20cm/8in square tin with baking parchment, leaving some excess paper hanging over the edges (this makes it easier to lift out once set).",
		"Melt the butter in a large pan over a low heat.",
		"Snap the chocolate into squares and throw into a small bowl. Melt in the microwave in 30 second blasts, stirring well between each addition or sit the bowl over a pan over simmering water. Make sure that the bottom of the pan does not touch the water or the chocolate may ‘seize’ and go really grainy and stiff.",
		"Blitz the digestive biscuits and brown sugar in a blender or food processor to give fine crumbs. Tip them into the melted butter. Stir in the peanut butter and vanilla extract and mix together so everything is well combined.",
		"Tip the mixture into the lined tin and press it down really hard with the back of the spoon. It needs to be really compact and tight. Then pour over the melted chocolate, tilting the tin back and forth a bit so that the whole thing is evenly covered. Pop in the freezer for 30 minutes to firm up (or the fridge for an hour).",
		"Once the chocolate is set, remove it from the freezer (or fridge). Lift it out of the tin with the help of the baking parchment. Remove the paper and then use a sharp knife to divide it into 16 squares and serve."
	]
}, {
	"name": "Toffee Apple Muffins",
	"cooking": "30 - 35 mins",
	"ingredients": ["2 free-range eggs, lightly beaten",
		"80g/2¾oz caster sugar",
		"240ml/8½fl oz milk",
		"100g/3½oz butter, melted",
		"300g/10½oz plain flour",
		"2 tsp baking powder",
		"½ tsp salt",
		"pinch cinnamon",
		"2 eating apples, peeled, cored, finely chopped",
		"200g/7oz shop-bought toffee pieces"
	],
	"methods": [
		"Preheat the oven to 190C/380F/Gas 5 and line a 12-hole muffin tin with paper cases.",
		"Mix the eggs, sugar, milk and melted butter in a large bowl. Sift the flour, baking powder, salt and cinnamon into the bowl. Stir well to combine.",
		"Add the chopped apple and lightly mix.",
		"Using half of the mixture, quarter-fill each of the muffin cases with the mixture and top with a few pieces of toffee. Cover with the remaining filling so the cases are half full.",
		"Bake for 30-35 minutes until well risen and golden. Transfer to a wire rack to cool. Serve warm or cold."
	]
}]