[{
	"name": "Pumpkin Pie",
	"cooking": "35 - 40 mins",
	"ingredients": ["Ready made sweet short crust pastry with 40g/1.5oz crushed pecans mixed in or make your own",
		"450g/1lb prepared weight pumpkin flesh, cut unto 1in/2.5cm chunks",
		"2 large eggs plus 1 yolk",
		"75g/3oz soft dark brown sugar",
		"1 tsp ground cinnamon",
		"½ tsp freshly grated nutmeg",
		"½ tsp ground allspice",
		"½ tsp ground cloves",
		"½ tsp ground ginger",
		"275ml/10fl oz double cream"
	],
	"methods": [
		"Pre-heat the oven to 200C/400F/Gas 6",
		"If using a shop bought sweet crust pastry case, use one that is 23cm/9in diameter and 4cm/1.5in deep. If using your own pastry, roll it out and use it to line a 23cm/9in pie plate (not loose bottomed). Bake the pastry case blind for 20 minutes.",
		"To make the filling, place the pumpkin chunks on a baking tray, cover with foil and roast until tender. This will take about 20-30 minutes, depending on your pumpkin. Press the cooked pumpkin in a coarse sieve and to extract any excess water. Set aside to cool before blending in a food processor, or mashing by hand to a puree.",
		"Lightly whisk the eggs and extra yolk together in a large bowl.",
		"Place the sugar, spices and the cream in a pan, bring to simmering point, giving it a whisk to mix everything together. Then pour it over the eggs and whisk it again briefly. Now add the pumpkin puree, still whisking to combine everything thoroughly.",
		"Reduce the oven temperature to 180C/350F/Gas 4. Pour the filling into your pastry case and bake for 35-40 minutes, by which time it will puff up round the edges but still feel slightly wobbly in the centre.",
		"Remove the pie from the oven and place the tin on a wire cooling rack. Serve warm or chilled (stored loosely covered in foil in the fridge) with some chilled creme fraiche or whipped cream."
	]
}, {
	"name": "Marshmallow Cobweb Cake",
	"cooking": "30 mins",
	"ingredients": ["250g/9oz unsalted butter, softened, plus extra for greasing",
		"250g/9oz caster sugar",
		"4 free-range eggs, lightly beaten",
		"1 tsp vanilla extract",
		"½ tsp black gel food colour (optional)",
		"50g/2oz cocoa powder",
		"200g/7oz self-raising flour",
		"200g/7oz dark chocolate (at least 70% cocoa solids), chopped into small pieces",
		"200ml/7fl oz double cream",
		"10 white marshmallows",
		"edible candy eyes"
	],
	"methods": [
		"Preheat the oven to 180C/350F/Gas 4.",
		"To make the cake, grease and line a 20x30cm/8x12in rectangular cake tin with baking paper.",
		"Beat together the butter and sugar with a hand-held mixer until pale and fluffy. Add the eggs, a little at a time, beating well between each addition. Add the vanilla extract and the black gel food colouring, if using, with the last of the egg.",
		"Sift together the cocoa powder and flour into a bowl. Fold the flour into the butter mixture until fully combined. Spoon the batter into the prepared tin and smooth the surface with the back of a spoon",
		"Bake for 30 minutes, or until springy to the touch (a skewer inserted into the centre of the cake should come out clean). Leave to cool for 10 minutes in the tin before turning out onto a wire rack to cool completely",
		"To make the chocolate ganache icing, put the cream into a saucepan and bring just to the boil. Pour into a heatproof bowl. Add the chopped chocolate, a little at a time, and stir until completely melted and the ganache is smooth and glossy. Leave to cool for a few minutes until it feels just warm to the touch",
		"Place the cake (on the cooling rack) onto a large sheet of newspaper or baking paper. Pour half the ganache onto the centre of the cake and spread out evenly to coat the top and sides, adding more as needed, to make a nice even coat. Allow to cool and set",
		"Meanwhile, lightly butter a non-stick saucepan, add the marshmallows and melt over a low heat, stirring frequently (or place in a lightly buttered heatproof bowl and microwave in 10 second bursts until melted, stiring often). The marshmallows don't need to melt completely before you remove them from the heat - they will continue melting on their own - but don't burn or overheat the marshmallow",
		"Check the marshmallow isn't too hot before taking a pinch between your fingers and pulling it appart so it makes thin strands. Drape the strands all over the cake in an irregular zig zag fashion. When the marshmallow in your fingers cools too much to pull, rinse your fingers in warm water and start again with another pinch. Place the edible eyes in pairs in the gaps between the marshmallow cobweb."
	]
}]